[
    {
        "id": 1,
        "name": "EtkKomplektCRM",
        "screenshotsFolderName": "lk_etk",
        "description": "Личный кабинет компании. Основные возможности: Переодическое обновление остатков и цен на сайте (сайт отдельно, на CMS OpenCart). С помощью прайс-листов поставщиков в разных форматах (.xlsx, .xml, .csv) и из разных источников (напрямую в браузер, из почты, от поставщика - FTP, API и т.д.). Настройках их загрузки автоматитчески. Настройка выгрузки данных о товарах в маркетплейсы (OzonSeller, YandexMarket, Sbermegamarket, ВсеИнструменты). Просмотр заказов. Редактирование товаров",
        "details_page": "https://github.com/Painven/EtkKomplektCRM",
        "tags": ["Blazor", "Telegram", "MySQL"],
        "last_update": "?",
        "screenshots": [
            {
                "filename": "1.png",
                "description": "Домашняя страница. Тут сюда попадают пользователи при заходе в личный кабинет. Показывается информация о последний товарах добавленных на сайт"
            },
            {
                "filename": "2.png",
                "description": "Страница настройки источников откуда загружаются остатки и цены для товаров на сайт. Каждый отдельный шаблон прописан в коде + дополнительные настройки можно проставить через редактирование шаблона"
            },
            {
                "filename": "3_1.png",
                "description": "Форма редактирования шаблона. Тут можно изменить наценку на прайс-лист, какие бренды нужно загружать из этого прайс-листа, каким образом загружается этот прайс-лист (Email, API, XML и т.д.)"
            },
            {
                "filename": "3-2.png",
                "description": "Форма редактирования шаблона"
            },
            {
                "filename": "3-3.png",
                "description": "Статистика изменения цены на товары для данного шаблона. При каждоый загрузке товары, цена которых изменилась с прошлого раза, сохраняются и на данной странице показаны товары который увеличили свою стоимость выше определенного порога"
            },
            {
                "filename": "3-4.png",
                "description": "График изменения цены для отдельного товара для отдельного прайс-листа. Если товар присутствуюет у нескольких поставщиков, - то будет отображен каждый отдельно. Тут же можно наглядно посмотреть какой поставщик ща какую цену продает этот товар"
            },
            {
                "filename": "4-1.png",
                "description": "Прайс-листы загруженные в память. Тут отображается предварительно загруженный прайс-лист, для дальнейшей загрузки на сайт"
            },
            {
                "filename": "4-2.png",
                "description": "Прайс-листы загруженные в память. Детали: отображает что внутри загруженного прайс-листа. Т.е. источник мог быт API, XML, XLSX и дюбой другой, а просмотреть данные можно на этой форме"
            },
            {
                "filename": "5-1.png",
                "description": "Настройки выгрузки файла для маркетплейса ВсеИнструменты. Можно указать: какая скидка будет для нужного бренда - и далее скачать полученный шаблон"
            },
            {
                "filename": "5-2.png",
                "description": "Настройки выгрузки файла для маркетплейса ВсеИнструменты. Режим предпросмотра скидок"
            },
            {
                "filename": "6-1.png",
                "description": "Настройка выгрузки XML фидов для маркетплейсов (YandexMarket, OzonSeller, Sbermegamarket). При изменении скидки через форму изменяется XML-фид файл который маркетплейс переодически запрашивает. Сам алгоритм генерации фид-файла сделан на PHP и в личном кабинете его нет"
            },
            {
                "filename": "7.png",
                "description": "Форма редактирования товара. Товар можно редактировать как через админку сайта (CMS OpenCart) так и через данную форму. Но через эту форму намного удобней для менеджеров, т.к. админка OpenCart отображает очень много ненужных данных для обычного менеджера, а в данной форме собрана только нужная инфомарция в компактной форме"
            },
            {
                "filename": "8-0.png",
                "description": "Форма добавления нового склада поставщика"
            },
            {
                "filename": "8-1.png",
                "description": "Список поставщиков с разбивкой по городам"
            },
            {
                "filename": "8-3.png",
                "description": "Список все брендов на сайта с алфавитной разбивкой с функционалом просмотра на каком складе товары какого бренда присутствуют через всплывающие уведомления (Toast)"
            },
            {
                "filename": "9-1.png",
                "description": "Список партнеров. Функционал позволяет создавать возможность для оптовых клиентов генерировать уникальную ссылку на XLSX файл, который при каждом запросе генерирует актуальные цены и остатки с наценка под конкретного клиента"
            },
            {
                "filename": "9-2.png",
                "description": "Список партнеров. ч2"
            },
            {
                "filename": "9-3.png",
                "description": "Список партнеров. ч3 - История запросов клиента"
            },
            {
                "filename": "10.png",
                "description": "Раздел скидок. Позволяет создавать скидки на отдельные: Товары или на целые категории, бренды, склады и т.д. Тоже самое можно делать через админку CMS OpenCart но там можно сделать только на один товар за раз"
            },
            {
                "filename": "11-1.png",
                "description": "Раздел скидок. Позволяет создавать скидки на отдельные: Товары или на целые категории, бренды, склады и т.д. Тоже самое можно делать через админку CMS OpenCart но там можно сделать только на один товар за раз"
            },
            {
                "filename": "11-3.png",
                "description": "Детали отдельного заказа. Тут менеджер может привязать код от Транспортной компании для автоматического уведомления клиента при прибытии заказа и изменить статус заказа вручную, проверить данные клиента по ИНН через сервис Dadata"
            },
            {
                "filename": "12.png",
                "description": "Страница планировщика задач который переодически обходит источники с прайс-листами и загружает актуальную информацию в заданное время каждый день"
            },
            {
                "filename": "12-1.png",
                "description": "Модальное окно создания нового задания для планировщика задач"
            },
            {
                "filename": "12-2.png",
                "description": "Журнал выполнения планировщика задач. По графику можно быстро посмотреть какие поставщики не обновляют свои данные или вообще перестали работать (выгружать) свои остатки/цены"
            },
            {
                "filename": "12-3.png",
                "description": "Редактирование отдельного задания в планировщике"
            },
            {
                "filename": "13-1.png",
                "description": "Список пользователей личного кабинета. Разделено на роли администратора и менеджера. Есть возможность определить IP адрес с которого пользователь может заходить"
            },
            {
                "filename": "13-2.png",
                "description": "Модальное окно создания нового пользователя"
            },
            {
                "filename": "13-3.png",
                "description": "Форма настроек выгрузки данных на второстепенные данные"
            },
            {
                "filename": "13-4.png",
                "description": "Форма настроек уведомлений в Telegram. События из личного кабинета передаются в группу бота. Тут можно указать какие события отправлять а какие нет"
            },
            {
                "filename": "14.png",
                "description": "Лог-журнал действий в личном кабинете с возможностью фильтрации"
            }
        ]
    },
    {
        "id": 5,
        "name": "etk-komplekt.ru",
        "screenshotsFolderName": "etk",
        "description": "Интернет-магазин строительной тематики (на 2023 год около 500 000 товаров) на основе шаблона OpenCart 2.1. Хотя сайт и сделан на основе шаблона OC - но было внесено огромное количество функционала, например: Модельные ряды для товаров, отображение остатков по отдельным складам для товара и расчет цены по алгоритму, новости, отзывы и много чего еще включая доработку админки и создание модулей (на php, css, html, js), личный кабинет из проекта EtkKomplektCRM был написан под этот сайт",
        "details_page": "https://etk-komplekt.ru",
        "tags": ["PHP", "HTML", "MySQL"],
        "last_update": "?",
        "screenshots": [
            {
                "filename": "1.png",
                "description": "Главная страница"
            },
            {
                "filename": "2.png",
                "description": "Страница отдельного товара"
            },
            {
                "filename": "3.png",
                "description": "Подбор рекомундуемых товаров для товара"
            },
            {
                "filename": "4.png",
                "description": "Баннеры на главной странице"
            },
            {
                "filename": "5.png",
                "description": "Страница вывода подтвержденных отзывов"
            },
            {
                "filename": "6.png",
                "description": "Страница вывода новостей"
            }
        ]
    },
    {
        "id": 4,
        "name": "PortfolioOverviewApp",
        "screenshotsFolderName": "portfolio",
        "description": "SPA приложение-библиотека разработанных программ. Рекурсия ⏎",
        "details_page": "https://github.com/Painven/PortfolioOverviewApp",
        "tags": ["VueJS", "HTML", "JSON"],
        "last_update": "?",
        "screenshots": [
            {
                "filename": "1.png",
                "description": "Главная страница"
            }
        ]
    },
    {
        "id": 2,
        "name": "MusicNewWatcher",
        "screenshotsFolderName": "mnwatcher",
        "description": "Программа для парсинга музыкальных (новинок) от разных провайдеров. Например сейчас настроено от Bandicamp.com и с сайта musify.club. Как работает - переодически опрашивает эти сайты, на наличие новинок для сохраненного списка исполнителей, - если появляется новинка отправляется уведомление в Telegram. Так же есть возможность скачать весь альбом прямо из программы. База данных PostgreSQL находится на VPS сервере, т.е. приложение можно открывать на разных компьютерах. Так же есть функционал синхронизации папок с музыкой на разных компьютерах что бы показало каких файлов нет на компьютере-клиенте, по сравнению с другим компьютером",
        "details_page": "https://github.com/Painven/MusicNewsWatcher",
        "tags": ["WPF", "MVVM", "PostgreSQL"],
        "last_update": "?",
        "screenshots": [
            {
                "filename": "1.png",
                "description": "Основное меню программы"
            },
            {
                "filename": "2.png",
                "description": "Окно добавления нового бренда с функцией автоподстановки (поиска) артиста для провайдера."
            },
            {
                "filename": "3.png",
                "description": "Форма просмотра разницы в треках на разных компьютерах"
            },
            {
                "filename": "4.png",
                "description": "Форма настроек. Тут можно указать API от телеграм бота на который будут приходить уведомления при нахождении новых треков и задать интервал проверки, количество потоков загрузки"
            }
        ]
    },
    {
        "id": 3,
        "name": "ImageCompressor",
        "screenshotsFolderName": "image_compressor",
        "description": "WPF Desktop приложение для массовой обработки изображений. Полезно когда есть много изображений - например товары в интернет-магазине, и их нужно однотипно обработать. Сжать, сделать все одного размера, при этом сохранив пропорции или преобразовать .png файлы в .jpg формат",
        "details_page": "https://github.com/Painven/ImageCompressor",
        "tags": ["WPF", "MVVM"],
        "last_update": "?",
        "screenshots": [
            {
                "filename": "1.png",
                "description": "Основное меню программы"
            }
        ]
    },
    {
        "id": 6,
        "name": "FLParser",
        "screenshotsFolderName": "fl_parser",
        "description": "Парсер сайта fl.ru с возможностью добавления ключевых слов которые нужно искать в проектах и задачей интервала обхода",
        "details_page": "https://github.com/Painven/FLWatcher",
        "tags": ["WPF", "MVVM"],
        "last_update": "?",
        "screenshots": [
            {
                "filename": "1.png",
                "description": "Главная страница"
            }
        ]
    },
    {
        "id": 7,
        "name": "AudioMerger",
        "screenshotsFolderName": "audio_merger",
        "description": "Программа простого накладывания треков один на другой. С помощью программы удобно например на длинный аудио файл наложить музыку с низним процентом громкости (можно указать в программе). Я часто использую ее когда загружаю какой-нибуть подкаст и накладываю поверх нужную мне музыку",
        "details_page": "https://github.com/Painven/AudioLayersMerger",
        "tags": ["WPF", "MVVM"],
        "last_update": "?",
        "screenshots": [
            {
                "filename": "1.png",
                "description": "Главная страница"
            }
        ]
    },
    {
        "id": 8,
        "name": "YoutubeDownloader",
        "screenshotsFolderName": "youtube_downloader",
        "description": "Программа для массовой скачки youtube видео в MP3 формат",
        "details_page": "https://github.com/Painven/YoutubeDownloader",
        "tags": ["WPF", "MVVM"],
        "last_update": "?",
        "screenshots": [
            {
                "filename": "1.png",
                "description": "Главная страница"
            }
        ]
    },
    {
        "id": 9,
        "name": "TodoList",
        "screenshotsFolderName": "todo_list",
        "description": "Обычное приложение типа Todo-лист (Список дел, записная книжка-напоминалка)",
        "details_page": "https://github.com/Painven/TodoList",
        "tags": ["WPF", "MVVM", "PostgreSQL"],
        "last_update": "?",
        "screenshots": [
            {
                "filename": "1.png",
                "description": "Окно входа в программу"
            },
            {
                "filename": "2.png",
                "description": "Главная страница с разбивкой по клиентам, клиентов можно добавлять (отдельная вкладка)"
            },
            {
                "filename": "3.png",
                "description": "Список книг на прочтение что бы не забыть"
            }
        ]
    },
    {
        "id": 10,
        "name": "MasterPassword",
        "screenshotsFolderName": "master_pass",
        "description": "Приложение для хранения и генерации паролей",
        "details_page": "https://github.com/Painven/MasterPassword",
        "tags": ["WPF", "MVVM", "PostgreSQL"],
        "last_update": "?",
        "screenshots": [
            {
                "filename": "1.png",
                "description": "Окно входа в программу"
            },
            {
                "filename": "2.png",
                "description": "Главная окно"
            },
            {
                "filename": "3.png",
                "description": "Форма генерации пароля"
            },
            {
                "filename": "4.png",
                "description": "Форма добавления нового пароля"
            }
        ]
    }
]
